Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
id      = "ManageSQS"
                    },
                    # (4 unchanged elements hidden)
                    {
                        Action   = [
                            "ecr:CreateRepository",
                            "ecr:DeleteRepository",
                            "ecr:PutLifecyclePolicy",
                            "ecr:DeleteLifecyclePolicy",
                            "ecr:SetRepositoryPolicy",
                            "ecr:DeleteRepositoryPolicy",
                            "ecr:TagResource",
                            "ecr:UntagResource",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ecr:ap-northeast-2:646886795421:repository/*"
                        Sid      = "ManageECR"
                    },
                  ~ {
                      ~ Action   = [
                          - "elasticache:CreateCacheParameterGroup",
                          - "elasticache:DeleteCacheParameterGroup",
                          - "elasticache:ModifyCacheParameterGroup",
                          - "elasticache:DescribeReplicationGroups",
                          + "rds:CreateDBInstance",
                          + "rds:DeleteDBInstance",
                          + "rds:ModifyDBInstance",
                          + "rds:CreateDBSubnetGroup",
                          + "rds:DeleteDBSubnetGroup",
                          + "rds:CreateDBParameterGroup",
                          + "rds:DeleteDBParameterGroup",
                          + "rds:ModifyDBParameterGroup",
                          + "rds:AddTagsToResource",
                          + "rds:RemoveTagsFromResource",
                        ]
                      ~ Sid      = "ManageElastiCacheParameters" -> "ManageRDS"
                        # (2 unchanged attributes hidden)
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateVpc",
                          + "ec2:DeleteVpc",
                          + "ec2:ModifyVpcAttribute",
                          + "ec2:CreateSubnet",
                          + "ec2:DeleteSubnet",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageVPC"
                    },
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                          + "route53:GetChange",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/*",
                          + "arn:aws:route53:::change/*",
                        ]
                      + Sid      = "ManageRoute53Records"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.ecs-task-execution-kms will be destroyed
  # (because aws_iam_role_policy.ecs-task-execution-kms is not in configuration)
- resource "aws_iam_role_policy" "ecs-task-execution-kms" {
      - id          = "atlantis-ecs-task-execution-prod:atlantis-ecs-task-execution-kms" -> null
      - name        = "atlantis-ecs-task-execution-kms" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:DescribeKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "atlantis-ecs-task-execution-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.ecs-task-execution-secrets will be destroyed
  # (because aws_iam_role_policy.ecs-task-execution-secrets is not in configuration)
- resource "aws_iam_role_policy" "ecs-task-execution-secrets" {
      - id          = "atlantis-ecs-task-execution-prod:atlantis-ecs-task-execution-secrets" -> null
      - name        = "atlantis-ecs-task-execution-secrets" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt",
                          - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "atlantis-ecs-task-execution-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.atlantis-task-execution-policy will be created
+ resource "aws_iam_role_policy_attachment" "atlantis-task-execution-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "atlantis-ecs-task-execution-prod"
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-policy will be destroyed
  # (because aws_iam_role_policy_attachment.ecs-task-execution-policy is not in configuration)
- resource "aws_iam_role_policy_attachment" "ecs-task-execution-policy" {
      - id         = "atlantis-ecs-task-execution-prod-20251011072359683400000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "atlantis-ecs-task-execution-prod" -> null
    }

  # aws_kms_key.ecr will be updated in-place
~ resource "aws_kms_key" "ecr" {
        id                                 = "fb74c860-dfb9-498f-9937-976a098b103c"
      ~ tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-atlantis"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                           = {
          + "Team"        = "platform-team"
            # (10 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_kms_key.efs will be updated in-place
~ resource "aws_kms_key" "efs" {
        id                                 = "16ebdf02-7634-495c-84ae-14da921267be"
      ~ tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "efs-atlantis"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                           = {
          + "Team"        = "platform-team"
            # (10 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_lb.atlantis will be destroyed
  # (because aws_lb.atlantis is not in configuration)
- resource "aws_lb" "atlantis" {
      - arn                                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> null
      - arn_suffix                                                   = "app/atlantis-prod/665f4d0af1d0e39d" -> null
      - client_keep_alive                                            = 3600 -> null
      - desync_mitigation_mode                                       = "defensive" -> null
      - dns_name                                                     = "atlantis-prod-965898050.ap-northeast-2.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                                   = false -> null
      - enable_cross_zone_load_balancing                             = true -> null
      - enable_deletion_protection                                   = false -> null
      - enable_http2                                                 = true -> null
      - enable_tls_version_and_cipher_suite_headers                  = false -> null
      - enable_waf_fail_open                                         = false -> null
      - enable_xff_client_port                                       = false -> null
      - enable_zonal_shift                                           = false -> null
      - id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> null
      - idle_timeout                                                 = 60 -> null
      - internal                                                     = false -> null
      - ip_address_type                                              = "ipv4" -> null
      - load_balancer_type                                           = "application" -> null
      - name                                                         = "atlantis-prod" -> null
      - preserve_host_header                                         = false -> null
      - security_groups                                              = [
          - "sg-02b0ffd94dd79e5a4",
        ] -> null
      - subnets                                                      = [
          - "subnet-0bd2fc282b0fb137a",
          - "subnet-0c8c0ad85064b80bb",
        ] -> null
      - tags                                                         = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Application Load Balancer for Atlantis Terraform automation server"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all                                                     = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Application Load Balancer for Atlantis Terraform automation server"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                                                       = "vpc-0f162b9e588276e09" -> null
      - xff_header_processing_mode                                   = "append" -> null
      - zone_id                                                      = "ZWKZPGTI48KDX" -> null
        # (3 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - subnet_mapping {
          - subnet_id            = "subnet-0bd2fc282b0fb137a" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-0c8c0ad85064b80bb" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # aws_lb_listener.atlantis-http will be destroyed
  # (because aws_lb_listener.atlantis-http is not in configuration)
- resource "aws_lb_listener" "atlantis-http" {
      - arn                                                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/ae9a38e85b067308" -> null
      - id                                                                  = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/ae9a38e85b067308" -> null
      - load_balancer_arn                                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> null
      - port                                                                = 80 -> null
      - protocol                                                            = "HTTP" -> null
      - routing_http_response_server_enabled                                = true -> null
      - tags                                                                = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "HTTP listener for Atlantis ALB redirects to HTTPS"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-http-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all                                                            = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "HTTP listener for Atlantis ALB redirects to HTTPS"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-http-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
        # (11 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - type             = "redirect" -> null
            # (1 unchanged attribute hidden)

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # aws_lb_listener.atlantis-https will be destroyed
  # (because aws_lb_listener.atlantis-https is not in configuration)
- resource "aws_lb_listener" "atlantis-https" {
      - arn                                                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/f91ddbf7d4915967" -> null
      - certificate_arn                                                       = "arn:aws:acm:ap-northeast-2:646886795421:certificate/695d4642-371c-4d49-b442-af89992ffbd5" -> null
      - id                                                                    = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/f91ddbf7d4915967" -> null
      - load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> null
      - port                                                                  = 443 -> null
      - protocol                                                              = "HTTPS" -> null
      - routing_http_response_server_enabled                                  = true -> null
      - ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06" -> null
      - tags                                                                  = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "HTTPS listener for Atlantis ALB"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-https-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all                                                              = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "HTTPS listener for Atlantis ALB"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-https-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
        # (18 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
          - type             = "forward" -> null
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.atlantis will be destroyed
  # (because aws_lb_target_group.atlantis is not in configuration)
- resource "aws_lb_target_group" "atlantis" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
      - arn_suffix                         = "targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
      - deregistration_delay               = "30" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "atl-20251011072359287200000001" -> null
      - name_prefix                        = "atl-" -> null
      - port                               = 4141 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Target group for Atlantis ECS service"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all                           = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Target group for Atlantis ECS service"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-0f162b9e588276e09" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/healthz" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # aws_secretsmanager_secret.atlantis-github-app will be updated in-place
~ resource "aws_secretsmanager_secret" "atlantis-github-app" {
        id                             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt"
        name                           = "atlantis/github-app-v2-prod"
      ~ tags                           = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "GitHub App credentials for Atlantis Terraform automation"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-github-app-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                       = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.atlantis-webhook-secret will be updated in-place
~ resource "aws_secretsmanager_secret" "atlantis-webhook-secret" {
        id                             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7"
        name                           = "atlantis/webhook-secret-v2-prod"
      ~ tags                           = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "GitHub webhook secret for validating webhook requests"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-webhook-secret-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                       = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.atlantis-github-app[0] will be destroyed
  # (because index [0] is out of range for count)
- resource "aws_secretsmanager_secret_version" "atlantis-github-app" {
      - arn            = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt" -> null
      - id             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt|terraform-20251012140026441300000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20251012140026441300000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.atlantis-webhook-secret[0] will be destroyed
  # (because index [0] is out of range for count)
- resource "aws_secretsmanager_secret_version" "atlantis-webhook-secret" {
      - arn            = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7" -> null
      - id             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7|terraform-20251012142201040100000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20251012142201040100000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.atlantis-alb will be destroyed
  # (because aws_security_group.atlantis-alb is not in configuration)
- resource "aws_security_group" "atlantis-alb" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-02b0ffd94dd79e5a4" -> null
      - description            = "Security group for Atlantis Application Load Balancer" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-02b0ffd94dd79e5a4" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP from allowed sources"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS from allowed sources"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "atlantis-alb-prod-20251011072849534000000001" -> null
      - name_prefix            = "atlantis-alb-prod-" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis Application Load Balancer"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-alb-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all               = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis Application Load Balancer"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-alb-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                 = "vpc-0f162b9e588276e09" -> null
    }

  # aws_security_group.atlantis-ecs-tasks will be destroyed
  # (because aws_security_group.atlantis-ecs-tasks is not in configuration)
- resource "aws_security_group" "atlantis-ecs-tasks" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-09eda99303e72ca2d" -> null
      - description            = "Security group for Atlantis ECS tasks" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-09eda99303e72ca2d" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow traffic from ALB"
              - from_port        = 4141
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-02b0ffd94dd79e5a4",
                ]
              - self             = false
              - to_port          = 4141
            },
        ] -> null
      - name                   = "atlantis-ecs-tasks-prod-20251011072853859500000002" -> null
      - name_prefix            = "atlantis-ecs-tasks-prod-" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis ECS tasks"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-tasks-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all               = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis ECS tasks"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-tasks-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                 = "vpc-0f162b9e588276e09" -> null
    }

  # aws_security_group.atlantis-efs will be destroyed
  # (because aws_security_group.atlantis-efs is not in configuration)
- resource "aws_security_group" "atlantis-efs" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-00b4a4594212637d2" -> null
      - description            = "Security group for Atlantis EFS mount targets" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-00b4a4594212637d2" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "NFS from ECS tasks"
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09eda99303e72ca2d",
                ]
              - self             = false
              - to_port          = 2049
            },
        ] -> null
      - name                   = "atlantis-efs-prod-20251011080725240400000001" -> null
      - name_prefix            = "atlantis-efs-prod-" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis EFS mount targets"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-efs-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all               = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis EFS mount targets"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-efs-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                 = "vpc-0f162b9e588276e09" -> null
    }

  # aws_security_group.vpc-endpoints will be destroyed
  # (because aws_security_group.vpc-endpoints is not in configuration)
- resource "aws_security_group" "vpc-endpoints" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-08366fa4751299ef2" -> null
      - description            = "Security group for VPC Interface Endpoints" -> null
      - egress                 = [] -> null
      - id                     = "sg-08366fa4751299ef2" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "HTTPS from VPC"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "vpc-endpoint-sg" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Component"   = "vpc-endpoints"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for VPC Interface Endpoints"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "vpc-endpoint-sg"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all               = {
          - "Component"   = "vpc-endpoints"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for VPC Interface Endpoints"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "vpc-endpoint-sg"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                 = "vpc-0f162b9e588276e09" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_vpc_endpoint.ecr-api will be updated in-place
~ resource "aws_vpc_endpoint" "ecr-api" {
        id                         = "vpce-0771cfdc087d31c5b"
      ~ security_group_ids         = [
          - "sg-08366fa4751299ef2",
        ] -> (known after apply)
      ~ tags                       = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-api-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "ECS container image pull optimization"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                   = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.ecr-dkr will be updated in-place
~ resource "aws_vpc_endpoint" "ecr-dkr" {
        id                         = "vpce-0a8c3a30df63ea53b"
      ~ security_group_ids         = [
          - "sg-08366fa4751299ef2",
        ] -> (known after apply)
      ~ tags                       = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-dkr-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "ECS Docker registry access optimization"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                   = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.logs will be updated in-place
~ resource "aws_vpc_endpoint" "logs" {
        id                         = "vpce-0b218cc766bee3ac8"
      ~ security_group_ids         = [
          - "sg-08366fa4751299ef2",
        ] -> (known after apply)
      ~ tags                       = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "logs-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "CloudWatch Logs optimization"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                   = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.s3 will be updated in-place
~ resource "aws_vpc_endpoint" "s3" {
        id                         = "vpce-00abd3a9518c62884"
      ~ tags                       = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "s3-gateway-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "Cost optimization for S3 access"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                   = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.secretsmanager will be updated in-place
~ resource "aws_vpc_endpoint" "secretsmanager" {
        id                         = "vpce-0d2a42aea9646d5f1"
      ~ security_group_ids         = [
          - "sg-08366fa4751299ef2",
        ] -> (known after apply)
      ~ tags                       = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "secretsmanager-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "Secure secrets access from private subnets"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                   = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.atlantis_alb.aws_lb.this will be created
+ resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "atlantis-prod"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0bd2fc282b0fb137a",
          + "subnet-0c8c0ad85064b80bb",
        ]
      + tags                                                         = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Application Load Balancer atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                                                     = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Application Load Balancer atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.atlantis_alb.aws_lb_listener.http["http"] will be created
+ resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTP listener for atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-http-http"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                                                              = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTP listener for atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-http-http"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.atlantis_alb.aws_lb_listener.https["https"] will be created
+ resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:ap-northeast-2:646886795421:certificate/695d4642-371c-4d49-b442-af89992ffbd5"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags                                                                  = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTPS listener for atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-https-https"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                                                              = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTPS listener for atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-https-https"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.atlantis_alb.aws_lb_target_group.this["atlantis"] will be created
+ resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "atlantis-prod-atlantis"
      + name_prefix                        = (known after apply)
      + port                               = 4141
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Component"   = "target-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Target group for atlantis-prod - atlantis"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-atlantis"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                           = {
          + "Component"   = "target-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Target group for atlantis-prod - atlantis"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-atlantis"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0f162b9e588276e09"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/healthz"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.atlantis_alb_sg.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for Atlantis Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "atlantis-alb-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "alb"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "alb"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # module.atlantis_alb_sg.aws_vpc_security_group_egress_rule.default[0] will be created
+ resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
    }

  # module.atlantis_alb_sg.aws_vpc_security_group_ingress_rule.alb-http["0.0.0.0/0"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "alb-http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTP traffic from internet"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-http-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-http-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                = 80
    }

  # module.atlantis_alb_sg.aws_vpc_security_group_ingress_rule.alb-https["0.0.0.0/0"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "alb-https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTPS traffic from internet"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-https-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-https-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                = 443
    }

  # module.atlantis_ecr.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 1
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.